/**
1转换位置（15分）
题目内容：

先输入10个整数，再输入一个ｍ(ｍ＜＝９)，使其前面各数顺序向后移m个位置，最后m个数变成最前面的m个数

输入格式:

1,2,3,4,5,6,7,8,9,10(回车)

3(回车)

输出格式：





8,9,10,1,2,3,4,5,6,7(回车)

输入样例：

1,2,3,4,5,6,7,8,9,10

3



输出样例：

8,9,10,1,2,3,4,5,6,7 */
#include <stdio.h>

int main() {
  int arr[10] = {0};
  for (int i = 0; i < 9; i++) {
    scanf("%d,", &arr[i]);
  }
  scanf("%d", &arr[9]);
  int n;
  scanf("%d", &n);

  for (int i = 10 - n; i < 10; i++) {
    printf("%d,", arr[i]);
  }
  for (int i = 0; i < 10 - n; i++) {
    printf("%d%c", arr[i], i == 9 - n ? '\n' : ',');
  }

  return 0;
}